[
  {
    "title": "Kinokoinu - Mushroom Pup Anime Reveals Promo Video, Visual, More Cast, Theme Song Artists",
    "description": "October debut also confirmed― The staff for the television anime of Kimama Aoboshi's Kinokoinu - Mushroom Pup manga unveiled the anime's promotional video, key visual, additional cast, more staff, and ending theme artist on Saturday. The staff also confirmed the series will debut in October. The new cast members include: Anna Nagase as Komako Amano Takuma Terashima as Yara Misaki Kuno as Plum Hinano...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213882",
    "genre": "anime",
    "time": "Aug  3, 12:30"
  },
  {
    "title": "Nights with a Cat Anime's 3rd Season Debuts in December",
    "description": "Main visual, character visuals also revealed― The staff of the anime of Kyuryu Z's Nights with a Cat (Yoru wa Neko to Issho) manga revealed on Saturday that the anime's third season will debut online in December. The staff also revealed a main visual as well as character visuals for Chikuwa and Konbu. The returning cast includes Ayahi Takagaki as Kyuruga, Satoshi Hino as Fuuta-kun, and Atsumi Taneza...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-08-03/nights-with-a-cat-anime-3rd-season-debuts-in-december/.213887",
    "genre": "anime",
    "time": "Aug  3, 09:00"
  },
  {
    "title": "Crunchyroll Adds 2nd Season of Megaton Musashi Anime in India",
    "description": "Anime season premiered in Japan in October 2021― Crunchyroll began streaming the second season of the television anime for Level 5's Megaton-kyū Musashi multimedia project in India on July 25. The anime's first season premiered on Tokyo MX and BS Fuji in October 2021 and aired its final episode in December 2021. The anime's second season premiered in October 2022 on Tokyo MX. The second season is a ...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-08-03/crunchyroll-adds-2nd-season-of-megaton-musashi-anime-in-india/.213874",
    "genre": "anime",
    "time": "Aug  3, 07:07"
  },
  {
    "title": "TMS Entertainment Streams N. American Premiere of Big X, More Anime on YouTube for 60th Anniversary",
    "description": "Also: Sonic X, Super Dimension Century Orguss, Lupin the IIIrd― TMS Entertainment announced on Friday that it will stream various anime on its official YouTube channel to commemorate its 60th anniversary. Among the anime is a recovered and digitized version of the first episode of Big X, which will be the first time this show is officially available in North America. The company will stream Big X on...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-08-02/tms-entertainment-streams-n-american-premiere-of-big-x-more-anime-on-youtube-for-60th-anniversary/.213900",
    "genre": "anime",
    "time": "Aug  2, 16:31"
  },
  {
    "title": "Duel Masters LOST Net Anime Reveals More Cast, Promo Video, Main Visual, Sequel Anime",
    "description": "Sequel manga Duel Masters LOST ~Gekka no Shinigami~ launches on August 8― The official X/Twitter account for the net anime based on Shigenobu Matsumoto and Yō Kanebayashi's Duel Masters LOST Tsuioku no Suishō (Duel Masters LOST: Crystal of Remembrance) manga, part of the Duel Masters LOST project, streamed a promotional video on Friday. The video reveals more cast and the main visual. It also reveal...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213894",
    "genre": "anime",
    "time": "Aug  2, 15:43"
  },
  {
    "title": "Silent Witch Light Novels Get Anime",
    "description": "Saya Aizawa stars are Monica Everett― The Aniplex x Kadokawa Anime Matsuri livestream event on Friday revealed that author Matsuri Isora and artist Nanna Fujimi's Silent Witch (Silent Witch: Chinmoku no Majo no Kakushigoto) light novel series is getting an anime. The event unveiled a visual: Saya Aizawa stars as Monica Everett. The livestream shared a video comment from Aizawa: The original novels d...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213893",
    "genre": "anime",
    "time": "Aug  2, 13:27"
  },
  {
    "title": "Shōgo Sakata Joins Cast of Class no Dai Kirai na Joshi to Kekkon suru Koto ni Natta. TV Anime",
    "description": "Key visual, staff also revealed― The Aniplex x Kadokawa Anime Matsuri livestream event on Friday revealed a new cast member for the television anime adaptation of Seiju Amano's Class no Dai Kirai na Joshi to Kekkon suru Koto ni Natta. (I Ended Up Marrying the Girl in My Class I Hated the Most) story. Shōgo Sakata costars as as Saito Hōjō. The event streamed a video, featuring the same footage as the...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213888",
    "genre": "anime",
    "time": "Aug  2, 12:37"
  },
  {
    "title": "Netflix Adds 7th Time Loop Anime in India on August 15",
    "description": "7th Time Loop: The Villainess Enjoys a Carefree Life Married to Her Worst Enemy! premiered in Japan on January 7, Muse Asia streamed it in India as it aired in Japan― Netflix is listing the television anime of Touko Amekawa and Wan Hachipisu's 7th Time Loop: The Villainess Enjoys a Carefree Life Married to Her Worst Enemy! (Loop 7-kaime no Akuyaku Reijō wa, Moto Tekikoku de Jiyū Kimamana Hanayome Se...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-08-02/netflix-adds-7th-time-loop-anime-in-india-on-august-15/.213756",
    "genre": "anime",
    "time": "Aug  2, 06:38"
  },
  {
    "title": "Make a Girl Anime Film's Teaser Trailer Reveals More Cast, January 31 Opening (Updated)",
    "description": "Yōji Ueda, Kana Hanazawa, Minami Hinata join cast― Kadokawa unveiled a new teaser trailer and visual on Friday for 3D anime creator Genshō Yasuda's first anime feature film Make a Girl. The teaser reveals more cast members for the film, and also reveals its January 31, 2025 opening date. The new cast members include: Yōji Ueda as Shōichi Takamine, Akira's father Kana Hanazawa as Eri Uminaka, a gradu...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213868",
    "genre": "anime",
    "time": "Aug  2, 03:55"
  },
  {
    "title": "'Please Put Them On, Takamine-san!' Risque Comedy Manga Gets TV Anime",
    "description": "Yūichi Hiiragi launched manga in January 2019― Square Enix and Kadokawa announced on Friday that Yūichi Hiiragi's Please Put Them On, Takamine-san! (Haite Kudasai, Takamine-san) manga is inspiring a television anime adaptation. Kadokawa unveiled a teaser visual for the anime, but did not reveal other information. Hiiragi also drew the below illustration to celebrate the anime's announcement. Yen Pre...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213865",
    "genre": "anime",
    "time": "Aug  2, 03:14"
  },
  {
    "title": "Netflix Streams Oshi no Ko Season 2 in India",
    "description": "Streaming service releases each episode of anime as it airs in Japan― Netflix began streaming the second Oshi no Ko anime season in India on July 3. The streaming service is releasing each episode of the anime as it airs in Japan. The season premiered on July 3 at 11:00 p.m. (10:00 a.m. EDT) on Tokyo MX and over 29 other channels throughout Japan. It is also streaming simultaneously on the ABEMA ser...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-08-02/netflix-streams-oshi-no-ko-season-2-in-india/.213754",
    "genre": "anime",
    "time": "Aug  2, 00:30"
  },
  {
    "title": "Through the Lens Entertainment, Fangoria to Produce Films Based on Junji Ito's 'Bloodsucking Darkness,' 'Mystery of the Haunted House' Manga",
    "description": "Aditya Chand, Jay Van Hoy, Junji Ito, more serve as producers― Pan-Asian film and entertainment studio Through the Lens Entertainment and horror brand Fangoria Studios are collaborating to produce films based on works by Junji Ito. The first three adaptations are for Ito's \"The Mystery of the Haunted House\" Parts 1 and 2, as well as the previously revealed \"Bloodsucking Darkness.\" Armen Aghaeian, Ta...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-08-01/through-the-lens-entertainment-fangoria-to-produce-films-based-on-junji-ito-bloodsucking-darkness-/.213832",
    "genre": "live-action",
    "time": "Aug  1, 17:35"
  },
  {
    "title": "Digimon Adventure Anime Streams 25th Anniversary Promo Video",
    "description": "Video features reanimated scenes from 1999 anime set to Kouji Wada's original theme song \"Butter-fly\"― The official Digimon Partners YouTube channel began streaming the 25th anniversary Digimon Adventure anime promotional video on Thursday. The video features reanimated scenes from the 1999 anime set to the original theme song \"Butter-fly\" by Kouji Wada: Yumeta Company produced the video. There will...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213831",
    "genre": "anime",
    "time": "Aug  1, 14:53"
  },
  {
    "title": "Peleliu Gaiden Manga to End in 4th Volume",
    "description": "Spinoff series debuted in 2022―  The third compiled book volume of Kazuyoshi Takeda's Peleliu Gaiden manga revealed on Monday that the manga, which is a spinoff of the Peleliu: Guernica of Paradise (Peleliu: Rakuen no Guernica) manga, will end with the fourth compiled book volume around July 2025. Takeda launched the spinoff series in Hakusensha's Young Animal magazine in March 2022. The main manga ...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-08-01/peleliu-gaiden-manga-to-end-in-4th-volume/.213713",
    "genre": "manga",
    "time": "Aug  1, 13:05"
  },
  {
    "title": "Odekake Kozame Anime Reveals New Series is Anime Film",
    "description": "New anime series for Penguin Box's manga first announced on May 10― Kadokawa announced that the new series for Penguin Box's Odekake Kozame (Little Shark's Outings) manga will be an anime film, and revealed the second teaser visual and a special video on Thursday. Penguin Box debuted the manga on X (formerly Twitter) in June 2021. The manga's fifth compiled book volume shipped in Japan on June 21. T...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213820",
    "genre": "anime",
    "time": "Aug  1, 09:13"
  },
  {
    "title": "'Tsuma, Shōgakusei ni Naru.' Anime's Teaser Reveals Kana Okazaki as Konomi",
    "description": "Daisuke Hirakawa, Aoi Yūki, Maiko Nomura also star in St. Signpost anime premering in October― The official website for the anime of Yayū Murata's Tsuma, Shōgakusei ni Naru. (If my wife [became] an elementary school student.) manga began streaming the second teaser trailer for the anime on Thursday. The trailer reveals that Kana Okazaki joins the anime's cast as Keisuke's subordinate Konomi Moriya. ...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213810",
    "genre": "anime",
    "time": "Aug  1, 03:48"
  },
  {
    "title": "Mikihisa Konishi's Petals of Reincarnation Action Manga Gets TV Anime",
    "description": "Manga about talented \"Returners\" who are reincarnated historical figures launched in May 2014― Mag Garden announced on Thursday that Mikihisa Konishi's Reincarnation no Kaben (Petals of Reincarnation) manga is inspiring a television anime. Mag Garden unveiled a visual for the anime, as well as a 10th anniversary promotional video for the manga, but did not reveal any other information for the anime....",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213807",
    "genre": "anime",
    "time": "Aug  1, 03:26"
  },
  {
    "title": "Anime NYC Screens World Premiere of Terminator Zero Anime, Hosts Staff",
    "description": "Masashi Kudo, Haruka Watanabe, Mattson Tomlin to attend convention on August 23-25― The staff for Anime NYC announced on Wednesday that this year's event will screen the world premiere for Skydance Animation and Production I.G's Terminator Zero anime series. The anime will screen on August 24 at 7:30 p.m. EDT at the convention's main stage. The event will also host the anime's director Masashi Kudo,...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-07-31/anime-nyc-screens-world-premiere-of-terminator-zero-anime-hosts-staff/.213795",
    "genre": "anime",
    "time": "Jul 31, 20:27"
  },
  {
    "title": "Live-Action Sugar Dog Life Series Reveals 3 New Cast Members, Ending Song",
    "description": "Girl band yayuyo performs \"Futari Yōbi\" ending song for August 3 series― The official X (formerly Twitter) account for the live-action series adaptation of Yoriko's Sugar Dog Life BL manga revealed three new cast members and a special teaser video on Wednesday. The video previews the ending theme song \"Futari Yōbi\" (The Two People's Day) by girl band yayuyo. The newly announced cast are: Toshiki Kas...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213773",
    "genre": "live-action",
    "time": "Jul 31, 19:00"
  },
  {
    "title": "Terminator Zero Anime Unveils New Trailer",
    "description": "Series premieres worldwide on Netflix on August 29― Netflix began streaming a new trailer for Skydance Animation and Production I.G's Terminator Zero anime series on Wednesday: Terminator Zero will premiere worldwide on Netflix on August 29. The series stars Timothy Olyphant as Terminator, André Holland as Malcolm Lee, Rosario Dawson as Kokoro, Sonoya Mizuno as Eiko, and Ann Dowd as The Prophet. Mat...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213787",
    "genre": "anime",
    "time": "Jul 31, 18:00"
  },
  {
    "title": "Delico's Nursery Anime's Video Reveals 5 Cast Members",
    "description": "Yōhei Azakami, Hikaru Midorikawa, Makoto Yasumura, Gentoku, Chinatsu Akasaki join cast― The official X/Twitter account for Delico's Nursery, a television anime based on Kenichi Suemitsu's TRUMP 2009 stage play, began streaming a video on Thursday, and it reveals five cast members: The newly announced cast includes: Yōhei Azakami as Keith\nHikaru Midorikawa as Julas Makoto Yasumura as Katarina Gentoku...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213784",
    "genre": "anime",
    "time": "Jul 31, 17:35"
  },
  {
    "title": "Your Lie in April London Stage Musical Run Cut Short to August 11",
    "description": "Musical version of Naoshi Arakawa's manga had been previously scheduled to run until September 21― The stage musical version of Naoshi Arakawa's Your Lie in April manga, running at The Harold Pinter Theatre in London's West End, will end its run on Sunday August 11, not on September 21 as previously announced. The play's tickets are available here. The WhatsOnStage website quotes the following comme...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-07-31/your-lie-in-april-london-stage-musical-run-cut-short-to-august-11/.213785",
    "genre": "live-action",
    "time": "Jul 31, 16:58"
  },
  {
    "title": "My Hero Academia: You're Next Film Streams English-Subbed Trailer",
    "description": "Film opens on Friday in Japan, October 11 in U.S.― TOHO International began streaming on Wednesday an English-subtitled trailer for My Hero Academia THE MOVIE: You're Next (My Hero Academia: You're Next), the fourth anime film in the My Hero Academia franchise. The video features the theme song \"Homunculus\" by Vaundy: The film will open in Japan on Friday. The film will simultaneously screen in IMAX...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213783",
    "genre": "anime",
    "time": "Jul 31, 16:18"
  },
  {
    "title": "Dragon Ball Daima Anime Gets World Premiere Screening at Special Event on October 6",
    "description": "Free \"Dragon Ball Daimatsuri\" event at Tokyo Big Sight features 3 screenings of 1st episode― The official website for the Dragon Ball franchise announced on Wednesday that the Dragon Ball Daima anime series will have its world premiere at a special \"Dragon Ball Daimatsuri\" (with \"Daimatsuri\" combining the words \"Daima\" and matsuri, which means festival) event on October 6 at Tokyo Big Sight. There w...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-07-31/dragon-ball-daima-anime-gets-world-premiere-screening-at-special-event-on-october-6/.213780",
    "genre": "anime",
    "time": "Jul 31, 16:08"
  },
  {
    "title": "Undead Unluck Anime Gets 1-Hour Special in Winter 2025",
    "description": "Teaser video, visual unveiled― The official website for the television anime of Yoshifumi Tozuka's Undead Unluck manga announced on Thursday that the anime is getting a one-hour special in winter 2025. The website unveiled a teaser video and visual: The announcement coincides with the day that the series' main characters Fuuko and Andy met, August 1. The anime's world premiere was held at Shinjuku P...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213782",
    "genre": "anime",
    "time": "Jul 31, 15:25"
  },
  {
    "title": "Exclusive: Titan Manga Licenses The Godless World of Onee-Chan, Dopeman, More Manga",
    "description": "Also: Farewell My Odin, Toxic Super Beasts, Cosmic Censorship, Outsiders, Yan in 2025― Titan Manga announced on Wednesday that it has licensed the following manga titles and will release them in 2025: Title: The Godless World of Onee-Chan\nCreators: Shinya Murata (story), Tokisada Hayami (art)\nRelease date: February 4\nSummary: This spin-off of the hit anime Working for God in a Godless World delivers...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213660",
    "genre": "manga",
    "time": "Jul 31, 15:00"
  },
  {
    "title": "Tohai: Ura Rate Mahjong Tohai Roku Anime Unveils 2nd Promo Video, Theme Song Artists",
    "description": "Masayoshi Oishi performs opening, Taiyo to Odore Tsukiyo ni Utae perform ending― The staff for the television anime of Kōji Shinasaka's Tohai: Ura Rate Mahjong Tohai Roku manga unveiled the second promotional video with English subtitles and the theme song artists. Singer-songwriter Masayoshi Oishi will perform the opening theme song, and idol group Taiyo to Odore Tsukiyo ni Utae will perform the en...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213778",
    "genre": "anime",
    "time": "Jul 31, 14:30"
  },
  {
    "title": "Crunchyroll Holds 1-Day Screenings of The Concierge, trapezium Films in N. America in September",
    "description": "The Concierge screens on September 11, trapezium on September 18― Crunchyroll announced on Wednesday that it will screen The Concierge and trapezium anime films for one-day engagements in North America, with The Concierge screening on September 11, and trapezium screening on September 18. Crunchyroll will also release The Concierge in Italy on September 23, Germany on September 24, Australia on Sept...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213763",
    "genre": "anime",
    "time": "Jul 31, 14:00"
  },
  {
    "title": "Nina the Starry Bride Anime's Video Reveals More Cast & Staff, Theme Songs, October 10 Debut",
    "description": "Nao Tōyama, Tatsuya Tomizawa join cast; Maaya Sakamoto, Nao Tōyama perform theme songs― The official website for the television anime of Rikachi's Nina the Starry Bride (Hoshifuru Ōkoku no Nina) manga revealed more cast, staff, and the anime's October 10 premiere in its first promotional video on Wednesday. The video also previews the opening song \"nina\" by Maaya Sakamoto, and the ending theme song ...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213772",
    "genre": "anime",
    "time": "Jul 31, 10:34"
  },
  {
    "title": "Frieren: Beyond Journey's End Manga Returns From Hiatus on August 7",
    "description": "Manga recently went on hiatus on May 15― The official X (formerly Twitter) account of Kanehito Yamada and Tsukasa Abe's Frieren: Beyond Journey's End (Sōsō no Frieren) manga announced on Wednesday that it will resume serialization starting in the combined 37th and 38th issue of Shogakukan's Weekly Shonen Sunday, which will release on August 7. The manga went on hiatus on May 15 after it shortly retu...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213765",
    "genre": "manga",
    "time": "Jul 31, 07:58"
  },
  {
    "title": "Sakamoto Days Anime Unveils More Cast Members, Confirms Netflix Streaming",
    "description": "Nobunaga Shimazaki, Ayane Sakura, Nao Toyama, Hina Kino, Ryōta Suzuki, Miyari Nemoto join January 2025 series― The staff for the television anime of Yuuto Suzuki's Sakamoto Days manga unveiled new cast members on Wednesday. The anime's staff also confirmed that the anime will air on TV Tokyo channel and its affiliates, and that it will stream on Netflix. The newly announced cast members are: Nobunag...",
    "detailLink": "https://www.animenewsnetwork.com/cms/discuss/213767",
    "genre": "anime",
    "time": "Jul 31, 07:52"
  },
  {
    "title": "Live-Action ACMA:Game Film's Trailer Reveals More Cast",
    "description": "Film opens in theaters on October 25― The staff for ACMA: Game: Saigo no Kagi (ACMA Game: The Final Key), the live-action film adaptation of Kōji Megumi and Meebu's ACMA:Game manga, revealed its full trailer, key visual, and more cast members on Wednesday. Nobuaki Kaneko will play Kōki Kuroda, a priest and shadowy figure of the Aigis cult. Mirai Shida will play Ran Kuroda, the founder of the cult, K...",
    "detailLink": "https://www.animenewsnetwork.com/news/2024-07-30/live-action-acma-game-film-trailer-reveals-more-cast/.213761",
    "genre": "live-action",
    "time": "Jul 31, 00:38"
  }
]